# A Whale off the Port(folio)
---

In this assignment, you'll get to use what you've learned this week to evaluate the performance among various algorithmic, hedge, andmutual fund portfolios and compare them against the S&P 500 Index.

In [1]:
# Initial Imports

import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path

%matplotlib inline

# Data Cleaning

In this section, you will need to read the CSV files into DataFrames and perform any necessary data cleaning steps. After cleaning, combine all DataFrames into a single DataFrame.

Files:

* `whale_returns.csv`: Contains returns of some famous "whale" investors' portfolios.

* `algo_returns.csv`: Contains returns from the in-house trading algorithms from Harold's company.

* `sp500_history.csv`: Contains historical closing prices of the S&P 500 Index.

## Whale Returns

Read the Whale Portfolio daily returns and clean the data

In [22]:
# Reading whale returns
path = "C:/Users/bmccr/smu-virt-fin-pt-04-2021-u-c/smu-virt-fin-pt-04-2021-u-c/04-Pandas/Pandas Homework/Starter_Code/Resources/"
whale_df = pd.read_csv(path + "whale_returns.csv")
whale_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [23]:
whale_df.dtypes

Date                            object
SOROS FUND MANAGEMENT LLC      float64
PAULSON & CO.INC.              float64
TIGER GLOBAL MANAGEMENT LLC    float64
BERKSHIRE HATHAWAY INC         float64
dtype: object

In [24]:
# Convert date object to datetime
whale_df["Date"] = pd.to_datetime(whale_df["Date"])

In [25]:
whale_df.dtypes

Date                           datetime64[ns]
SOROS FUND MANAGEMENT LLC             float64
PAULSON & CO.INC.                     float64
TIGER GLOBAL MANAGEMENT LLC           float64
BERKSHIRE HATHAWAY INC                float64
dtype: object

In [13]:
whale_df.shape

(1060, 5)

In [14]:
# Count nulls
whale_df.isnull().sum()

Date                           0
SOROS FUND MANAGEMENT LLC      1
PAULSON & CO.INC.              1
TIGER GLOBAL MANAGEMENT LLC    1
BERKSHIRE HATHAWAY INC         1
dtype: int64

In [15]:
# Drop nulls
whale_df.dropna(inplace = True)

In [16]:
whale_df.shape

(1059, 5)

In [44]:
whale_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
0,2015-03-02,NaN,NaN,NaN,NaN
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213
3,2015-03-05,0.004016,0.004076,0.002355,0.006726
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

## Algorithmic Daily Returns

Read the algorithmic daily returns and clean the data

In [26]:
# Reading algorithmic returns
algo_df = pd.read_csv(path + "algo_returns.csv")
algo_df.head()

         Date    Algo 1  Algo 2
0  2014-05-28  0.001745     NaN
1  2014-05-29  0.003978     NaN
2  2014-05-30  0.004464     NaN
3  2014-06-02  0.005692     NaN
4  2014-06-03  0.005292     NaN

In [27]:
algo_df.dtypes

Date       object
Algo 1    float64
Algo 2    float64
dtype: object

In [28]:
# Convert date object to datetime
algo_df["Date"] = pd.to_datetime(algo_df["Date"])

In [29]:
algo_df.dtypes

Date      datetime64[ns]
Algo 1           float64
Algo 2           float64
dtype: object

In [30]:
# Count nulls
algo_df.isnull().sum()

Date      0
Algo 1    0
Algo 2    6
dtype: int64

In [31]:
algo_df.shape

(1241, 3)

In [32]:
# Drop nulls
algo_df.dropna(inplace = True)

In [33]:
algo_df.shape

(1235, 3)

In [43]:
algo_df.head()

         Date    Algo 1    Algo 2
6  2014-06-05  0.004062  0.013285
7  2014-06-06  0.001857  0.008284
8  2014-06-09 -0.005012  0.005668
9  2014-06-10  0.004406 -0.000735
10 2014-06-11  0.004760 -0.003761

## S&P 500 Returns

Read the S&P 500 historic closing prices and create a new daily returns DataFrame from the data.

In [66]:
# Reading S&P 500 Closing Prices
sp_df = pd.read_csv(path + "sp500_history.csv")
sp_df.head()

        Date     Close
0  23-Apr-19  $2933.68
1  22-Apr-19  $2907.97
2  18-Apr-19  $2905.03
3  17-Apr-19  $2900.45
4  16-Apr-19  $2907.06

In [67]:
# Data is in reverse date order compared to other dataframes, so we will reverse the order to match others (ascending)
sp_df = sp_df.reindex(sp_df.index[::-1])
sp_df.head()

          Date     Close
1648  1-Oct-12  $1444.49
1647  2-Oct-12  $1445.75
1646  3-Oct-12  $1450.99
1645  4-Oct-12  $1461.40
1644  5-Oct-12  $1460.93

In [68]:
# Check data types
sp_df.dtypes

Date     object
Close    object
dtype: object

In [69]:
# Fix Data Types
sp_df["Date"] = pd.to_datetime(sp_df["Date"])

In [70]:
sp_df.dtypes

Date     datetime64[ns]
Close            object
dtype: object

In [71]:
# Clean data by removing $ signs
sp_df["Close"] = sp_df["Close"].str.replace("$" , "")
sp_df.head()

           Date    Close
1648 2012-10-01  1444.49
1647 2012-10-02  1445.75
1646 2012-10-03  1450.99
1645 2012-10-04  1461.40
1644 2012-10-05  1460.93

In [72]:
# Clean data by changing close object to float
sp_df["Close"] = pd.to_numeric(sp_df["Close"])

In [73]:
sp_df.dtypes

Date     datetime64[ns]
Close           float64
dtype: object

In [74]:
# Calculate Daily Returns (change close from price to percentage change)
sp_df["Close"] = sp_df["Close"].pct_change()

In [75]:
sp_df.head()

           Date     Close
1648 2012-10-01       NaN
1647 2012-10-02  0.000872
1646 2012-10-03  0.003624
1645 2012-10-04  0.007174
1644 2012-10-05 -0.000322

In [76]:
# Count nulls
sp_df.isnull().sum()

Date     0
Close    1
dtype: int64

In [77]:
sp_df.shape

(1649, 2)

In [78]:
# Drop nulls
sp_df.dropna(inplace = True)

In [79]:
sp_df.shape

(1648, 2)

In [81]:
# Rename `Close` column to be specific to this portfolio (not to be confused with close values from other dataframes)
sp_df["S&P500"] = sp_df["Close"]
sp_df.head()

           Date     Close    S&P500
1647 2012-10-02  0.000872  0.000872
1646 2012-10-03  0.003624  0.003624
1645 2012-10-04  0.007174  0.007174
1644 2012-10-05 -0.000322 -0.000322
1643 2012-10-08 -0.003457 -0.003457

In [82]:
# Remove `Close` column since we just added that column under a new name (S&P500)
del sp_df["Close"]
sp_df.head()

           Date    S&P500
1647 2012-10-02  0.000872
1646 2012-10-03  0.003624
1645 2012-10-04  0.007174
1644 2012-10-05 -0.000322
1643 2012-10-08 -0.003457

## Combine Whale, Algorithmic, and S&P500 Returns

In [94]:
# Join Whale Returns, Algorithmic Returns, and the S&P 500 Returns into a single DataFrame with columns for each portfolio's returns.
whale_algo_df = pd.merge(left = whale_df, right = algo_df, how = "inner")
whale_algo_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC,Algo 1,Algo 2
0,2015-03-02,NaN,NaN,NaN,NaN,-0.008158,0.003200
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569,-0.001942,-0.000949
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213,-0.008589,0.002416
3,2015-03-05,0.004016,0.004076,0.002355,0.006726,-0.000955,0.004323
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098,-0.004957,-0.011460

In [95]:
# Since you can only merge 2 dataframes at a time, add the 3rd (S&P500) dataframe
combined_df = pd.merge(left = whale_algo_df, right = sp_df, how = "inner")
combined_df.head()

,Date,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC,Algo 1,Algo 2,S&P500
0,2015-03-02,NaN,NaN,NaN,NaN,-0.008158,0.003200,0.006125
1,2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569,-0.001942,-0.000949,-0.004539
2,2015-03-04,0.002230,0.003241,-0.002534,0.004213,-0.008589,0.002416,-0.004389
3,2015-03-05,0.004016,0.004076,0.002355,0.006726,-0.000955,0.004323,0.001196
4,2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098,-0.004957,-0.011460,-0.014174

In [ ]:
combined_df = pd.merge(whale_df,algo_df, how ="inner", on = "Date")

combined_df = combined_df.T.drop_duplicates().T
combined_df